# เขียนโปรแกรม รับชื่ออายุ ทางแป้นพิมพ์ แล้วแสดงผลออกมาว่า ชื่อ อายุนั้นเป็น เด็ก คนหนุ่ม หรือคนแก่
#อายุน้อยกว่า 18 คือ เด็ก /อายุ19-45 คือ คนหนุ่ม/46 ขึ้นไปคือคนแก่

#หาฟีเจอร์การทำงาน เพื่อจะเอาไปเขียนเป็นฟังก์ชั่น
#ฟีเจอร์ รับค่าข้อมูล , ตรวจสอบและแสดงผลว่าเป็น เด็ก คนหนุ่ม หรือคนแก่ , แสดงชื่อโปรแกรม

def SPN() :
    print('**--โปรแกรมตรวจสอบความเป็นเด็ก หนุ่ม แก่--**')

def inputData() :
    name = input('ป้อนชื่อ : ')
    age = int(input('ป้อนอายุ : '))
    return name, age

def CSS(name, age) :
    if age <= 18 :
        print(f'ท่าน{name}อายุ {age} ปี เป็นเด็กกะโปก')
    elif age >= 19 and age <= 45 :
        print(f'ท่าน{name}อายุ {age} ปี เป็นคนเหี้ย')
    else :
        print(f'ท่าน{name}อายุ {age} ปี เป็นไอ้แก่')
print('----------------------------------------------')
SPN()
print('----------------------------------------------')
name, age =inputData()
print('----------------------------------------------')
CSS(name, age)
print('----------------------------------------------')